app/Controllers/Test.php

SELECT *
FROM `quiz`
WHERE `quiz`.`id` = '26'
SELECT *
FROM `response`
WHERE `test_id` = '26'
SELECT *
FROM `question`
---
    public function finish($quizId)
    {
        $resultModel = new ResultModel();
        $questionModel = new QuestionModel();
        $responseModel = new ResponseModel();

        $quiz = $this->quizModel->find($quizId);
        if (!$quiz) {
            return redirect()->to('/test');
        }

        $responses = $responseModel->where('test_id', $quizId)->findAll();
        $questions = $questionModel->findAll();

SELECT *
FROM `question`
WHERE `question`.`id` = '1'
---
            if ($res['is_correct']) {
                $score_test++;

                $question = $questionModel->find($res['question_id']);

SELECT *
FROM `result`
---
            }
        }

        $results = $resultModel->findAll();

UPDATE `quiz` SET `score_test` = 4, `score_sw` = '88', `result` = 'Rendah', `result_type` = '{\"Aritmatika Dasar\":2,\"Pola Naik Turun\":1,\"Kombinasi Logika\":0,\"Pola Tetap Berubah\":0,\"Pola Acak Visual\":1}'
WHERE `quiz`.`id` IN ('26')
---
        }

        // Update quiz
        $this->quizModel->update($quizId, [
            'score_test' => $score_test,
            'score_sw'   => $score_sw,
            'result'     => $result_text,
            'result_type' => json_encode($correct_by_type),
        ]);