app/Models/QuizModel.php

    public function getTestResults()
    {
        $userId = session()->get('user_id');
        return $this->where('user_id', $userId)
            ->where('result IS NOT NULL')
            ->where('result_type IS NOT NULL')
            ->findAll();
---
SELECT *
FROM `quiz`
WHERE `user_id` = '4'
AND `result` IS NOT NULL
AND `result_type` IS NOT NULL